import 'package:flutter/material.dart';

class black
{
  static List shayari = [
    "love shayari",
    "sad shayari",
    "romantic shayari",
    "frnds shayari",
    "attitude shayari",
    "dangerous shayari",
    "new year shayari",
    "diwali shayari",
    "good morning shayari",
    "good night shayari",
    "independence day shayari"
  ];
  static List emoji = [
    "😍 🥰😘💕💞💓💗💖❤🌹",
    "😢😥😪😓😭😟😞",
    "💋👙🥵🥰🤗👄💖🤤💏💑💕💞",
    "🤛👊🤜☝💝💙",
    "😈💀☠⚔🧛♀️",
    "😈💀☠⚔🧛♀️🕍🩸🏴☠",
    "🌟🔥🎆🎇🥳🧨🗽🎈",
    "🌟🔥🎆🎇🧨💥🪔",
    "🌞☀❄🌕🌝",
    "🌜🌙😴🥱",
    "🎆🎇🧨💥ANZ🏴🎈"
  ];
  static List imgs = [
    "love2.jpg",
    "sad.jpg",
    "romantic.jpg",
    "frnds.jpg",
    "attitude.jpg",
    "fg.jpg",
    "newyear.jpg",
    "diwali.jpg",
    "morning.jpg",
    "goodnight.jpg",
    "2.jpg"
  ];
  static List mycolor = [
    Colors.black,
    Colors.amber,
    Colors.lightBlueAccent,
    Colors.deepOrangeAccent,
    Colors.greenAccent,
    Colors.indigoAccent,
    Colors.yellowAccent,
    Colors.lightBlue,
    Colors.teal,
    Colors.pink,
    Colors.white,
    Colors.purple,
    Colors.limeAccent,
    Colors.blueGrey,
    Colors.green,
    Colors.deepPurple,
    Colors.yellow,
    Colors.redAccent,
    Colors.red,
    Colors.deepOrange,
    Colors.amberAccent,
    Colors.blueAccent,
    Colors.blue,
    Colors.lime,
    Colors.cyanAccent,
    Colors.cyan,
    Colors.pinkAccent,
    Colors.orange,
    Colors.tealAccent,
    Colors.purpleAccent,
    Colors.orangeAccent,
    Colors.lightGreenAccent,
    Colors.lightGreen,
    Colors.brown,
    Colors.indigo,
    Colors.deepPurpleAccent,
    Colors.grey,
    Colors.black87,
    Colors.cyan,
    Colors.pinkAccent,
    Colors.orange,
    Colors.tealAccent,
    Colors.purpleAccent,
    Colors.orangeAccent,
    Colors.lightGreenAccent,
    Colors.lightGreen,
    Colors.brown,
    Colors.indigo,
    Colors.deepPurpleAccent,
    Colors.grey,
    Colors.black87,
    Colors.transparent,
    Colors.white54,
    Colors.purple
  ];

  static List <String> love =
  [
    'khuda ne furast me jab tuje banaya hoga,'
        'ek surur sa uske dil me 6aya hoga,'
        'akho main tami adao me puri kaynat ke nazare barke..,'
        'sach kaha tu tuje dharti pe bhejne se pahale ..,'
        'khuda ka bhi iman dagmagaya hoga....!'
        '😍 🥰😘💕💞💓💗💖❤🌹',
    'जब जब किसी को चाहने का सवाल आया,'
        'दिल को बस तेरा ही ख्याल आया।,'
        ' 🥰😘💕💞💓💗💖❤🌹',
    'मेरी सांसों पर बस नाम तुम्हारा है,'
        'मैं अगर खुश हूं तो ये एहसान तुम्हारा है...।'
        '🥰😘💕💞💓💗💖❤🌹',
    'तेरी मोहब्बत में डूब कर बूँद से दरिया हो जाऊँ,'
        ' मैं तुझसे शुरू होकर तुझमे खत्म हो जाऊं।'
        '💓💗💖❤🌹',
    'गवाही ना मांग हमसे कि हम तुझे कितना चाहते हैं,'
        'खुदा भी हमसे परेशान है कि हम दुआ में सिर्फ तुझे ही क्यों मांगते हैं।'
        '💕💞💓💗💖❤🌹',
    'कुछ तो सोचा होगा किस्मत ने तेरे मेरे बारे में,'
        ' वरना इतनी बड़ी दुनिया में तुमसे ही मोहब्बत क्यों होती।'
        '💕💞💓💗💖❤🌹',
    'प्रेम का नाता संसार के सभी संबंधों से पवित्र और श्रेष्ठ है।'
        '💕💞💓💗💖❤🌹',
    'बड़ी मुद्दत से चाहा है तुझे! '
        'बड़ी दुआओं से पाया है तुझे! '
        'तुझे भुलाने की सोचूं भी तो कैसे!'
         'किस्मत की लकीरों से चुराया है तुझे!'
        '💕💞💓💗💖❤🌹',
    'उस चांद को बहुत गुरूर है,'
        'कि उसके पास नूर है।'
        'अब मैं उसे कैसे समझाऊं,'
        'मेरे पास कोहिनूर है।'
        '💕💞💓💗💖❤🌹',
    'इन आंखों में जो तस्वीर है वो तेरी है,'
        'दिल की हर धड़कन बस तेरी है,'
        'नहीं चाहिए सारे जहां की खुशियां मुझे,'
        'खुदा करे तुझे मिल जाए,'
        'वह सारी खुशियां जो मेरी है।,..'
        '💕💞💓💗💖❤🌹',
    'मंजिल भी तुम हो, तलाश भी तुम हो'
        'उम्मीद भी तुम हो, आस भी तुम हो'
        'कैसे कहूँ इश्क भी तुम हो और जूनून भी तुम ही हो।'
        '🥰😘💕💞💓💗💖❤🌹',
    // 'अपनी सांसों में महकता पाया है तुझे,'
    //     'हर ख्वाब मे बुलाया है तुझे, क्यू न करे याद'
    //     'तुझ को जब खुदा ने हमारे लिए बनाया है तुझे.'
    //     '💕💞💓💗💖❤🌹',
    // 'तुम मेरी बाहों का हार बनो,'
    //     'मेरे आँखो की चमक बनो,'
    //     'तुम इस दिल की धड़कन बनो,'
    //     'मेरे साँसों की महक बनो,'
    //     'बस हर पल यूही इस दिल की चाहत बनो.'
    //     'Love You Sweet Heart.',

  ];
  static List <String> sad = [];
  static List <String> romantic = [
    'तुम लाख छुपाओ सीने में,'
        'एहसास हमारी चाहत का,'
        'दिल जब भी तुम्हारा धड़का हैं,'
        'आवाज़ यहाँ तक आई हैं।'
        '💋👙🥵🥰🤗👄💖🤤💏💑💕💞',
    'जब मुझे प्यास लगती हैं न'
        'तो आपके रसीले'
        'होठों की बहुत याद आती हैं।'
        '💋🥰🤗👄🤤💏💑',
    'न कोई ज़िद है, ना कोई गुरूर है'
        'बस तुम्हे पाने का सुरूर है हमे,'
        'इश्क़ गुनाह है तो गलती की हमने,'
        'सज़ा जो भी हो, मंजूर है हमें।,'
        '🥵🥰🤗👄💖🤤',
    'तन्हाई लेजाती हैं जहाँ तक याद तुम्हारी,'
        'वही शुरू होती है जीवन हमारी,'
        'नही सोचा था की हम चाहेंगे तुम्हे इस कदर,'
        'पर अब तो बन गयी हो किस्मत हमारी।'
        '💖🤤💏💑💕💞',
    'तुम्हारी lovely आँखों ने'
        'हमें ऐसे attract किया,'
        'की सबको neglect करके,'
        'तुम्हे ही सेलेक्ट किया।,'
        '💋👙🥵🥰🤗🤗👄💖🤤',
    'तुम बस मुस्कुराया करो मेरी जान क्युकी'
        'तुम्हारी स्माइल में ही तोह मेरी जान बस्ती है।'
        '💏💑💕💞',
    'अपनी सांसों में महकता पाया है तुझे,'
        'हर ख्वाब मे बुलाया है तुझे, क्यू न करे याद'
        'तुझ को जब खुदा ने हमारे लिए बनाया है तुझे.',
    'रब से आपकी खुशीयां मांगते है,'
        'दुआओं में आपकी हंसी मांगते है,'
        'सोचते है आपसे क्या मांगे,चलो आपसे'
        'उम्र भर की मोहब्बत मांगते है।',
    'अपने जज्बातों को मैंने उस मुकाम पे ला रखा है,'
        'जहां परवाह नहीं मुझे कि मेरी बात कौन करता हैं।..,'
        '🤗🤗👄💖🤤'

  ];
  static List <String> frnds = [
    "“खुदा अगर 👬Dost का,"
        "रिसता ना बनाता तो,"
        "इंसान 👨‍💼कभी यकीन ना,"
        "करता कि अजनबी लोग,"
        "अपनो से भी ❤प्यारे हो सकते हैं।”,"
        "🤛👊🤜☝💝💙",
    "“याद करते हैं हम यारो की दोस्ती,"
        "यादों से दिल भर जाता है,"
        "कल साथ जिया करते थे मिलकर,"
        "आज मिलने को दिल तरस जाता है”,.."
        "🤛👊🤜☝💝💙",
    "a दोस्ती वो नहीं जो जान देती है,"
        " दोस्ती वो नहीं जो मुस्कान देती है,"
        "सच्ची दोस्ती तो वो है"
        "जो पानी में गिरा आंसू भी पहचान ले ती है.,,"
        "🤛👊🤜☝",
    "ज़िन्दगी हर पल कुछ खास नहीं होती,"
        "फूलों की खुशबू हमेशा पास नहीं होती,"
        "मिलना हमारी तक़दीर में था वरना,"
        "इतनी प्यारी दोस्ती इत्तेफाक नहीं होती,"
        "🤛👊🤜☝💝💙",
    "ज़िन्दगी के तूफानों का साहिल है दोस्ती,"
        "दिल के अरमानों की मंज़िल है दोस्ती,"
        "ज़िन्दगी भी बन जाएगी अपनी तो जन्नत,"
        "अगर मौत आने तक साथ दे दोस्ती।"
        "🤛👊🤜☝💝💙"
  ];
  static List <String> attitutde = [
    "शेर अपनी ताकत से राजा कहलाता है,"
        "क्योंकी जंगल मे चुनाव नही होते ।।"
        "😈💀☠⚔🧛♀️",
    "एक दिन अपनी भी Entry शेर जैसी होगी…"
        "जब शोर कम खौफ ज्‍यादा होगा…"
        "😈💀☠⚔🧛♀",
    "जो मेरे मुक्कदर में है,"
        "वो खुद चल कर आएगा,"
        "जो नहीं है उसे अपना खौफ लाएगा!"
        "😈💀☠⚔🧛♀",
    "बड़ी से बड़ी हस्ती मिट गयी मुझे झुकाने मे,"
        "बेटा तू तो कोशिश भी मत करना तेरी उम्र"
        "गुजर जायगी मुझे गिराने मे.."
        "😈💀☠⚔🧛♀",
    "तू मोहब्बत है मेरी इसीलिए दूर है मुझसे,"
        "अगर जिद होती तो शाम तक बाहों में होती..!!"
        "😈💀☠⚔🧛♀",
    "मेरी ख़ामोशी को कमजोरी ना समझ ऐ काफिर,"
        "गुमनाम समन्दर ही खौफ लाता है..!!"
        "😈💀☠⚔🧛♀"
  ];
  static List <String> dangerous = [
    "जो मेरे मुक्कदर में है,"
        "वो खुद चल कर आएगा,"
        "जो नहीं है उसे अपना खौफ लाएगा!"
        "😈💀☠⚔🧛♀️🕍🩸🏴☠",
    "दुनिया दारी की चादर ओढ़ के बैठे हैं.."
        " पर जिस दिन दिमाग सटका ना तो"
        "इतिहास भी बदल देंगे.."
        "😈💀☠⚔🧛♀️🕍🩸🏴☠",
    "टक्कर की बात मत करो जिस दिन सामना होगा,"
        "उस दिन हस्ती मिटा देंगे..!!"
        "😈💀☠⚔🧛♀️🕍🩸🏴☠",
    "होसले हमारी आग जेयसा .."
        "किसी मे दाम नेही जो रोख पायेगा !!"
        "लेगा जो टक्कर मुजसे.."
        "अगली सुभा का सुरज देक नेही पायेगा !!!"
        "💀☠⚔🧛♀️🕍🩸🏴☠",
    "मेरी मोत का डर नही है मुझे.."
        "डर मुझे इस बात कि है,"
        "तुझे छोड कर मै जियुंगा कैसे !!!"
        "💀☠⚔🧛♀️🕍🩸🏴☠",
    "बड़ी से बड़ी हस्ती मिट गयी मुझे झुकाने मे,"
        "बेटा तू तो कोशिश भी मत करना तेरी उम्र,"
        "गुजर जायगी मुझे गिराने मे.."
        "☠⚔🧛♀️🕍🩸🏴☠",
    "औकात का तो वक्त आने पर ,"
        "पत्ता चलता है,रात को गिदड़,"
        "कितना भी चिल्ला ले, सुबह तो,"
        "शेरो का ही दबदबा होता है.."
        "🕍🩸🏴☠",
    "जंग लगी तलवारो पे Ab धार चढानी होगी,"
        "कुछ लोग ओकात भूल gYe हे, शायद,"
        "उनको Humari याद दिलानी होगी..,"
        "💀☠😈⚔🧛♀"


  ];
  static List <String> newyear = [
    "तुम मेरे लिए,"
        "प्यार की परिभाषा हो,"
        "क्या कहूं तुम्हें तुम तो,"
        "खुशी की अभिलाषा हो।,"
        "हैप्पी न्यू ईयर 2023,"
        "🌟🔥🎆🎇🥳🧨🗽🎈",
    "मौसम ठंड का आ गया,"
        "आओ गर्मी फैलाते हैं,"
        "आ गया है नया साल,"
        "आओ प्यार के दीए जलाते हैं।,"
        "Happy New Year 2023,"
        "🔥🎆🎇🥳🧨🗽🎈",
    "Cheers to the New Year! May 2023 be an extraordinary one!"
        "2023 is the beginning of a new chapter.,"
        "This is your year,"
        "Make it happen.,"
        "Happy New Year!,"
        "🔥🎆🎇🥳🧨🗽🎈",
    "डे बाई डे तेरी खुशियां हो जायें डबल,"
        "तेरी जिंदगी से डिलीट हो जायें सारे ट्रबल,"
        "खुदा रखे हमेशा तुझे स्मार्ट एंड फिट,"
        "तेरे लिये न्यू इयर हो सुपर डुपर हिट,"
        "🌟🔥🎆🎇🥳🧨🗽🎈",
    "गुल ने गुलशन से गुलफाम भेजा है,"
        "सितारो ने आसमान से सलाम भेजा है,"
        "मुबारक हो आपको नया साल,"
        "हम ने ये ADVANCE में ये पैगाम भेजा है!!"
        "नए साल की हार्दिक शुभकामनाएं।"
        "🌟🔥🎆🎇",
    "अब के बार मिल के यूँ साल-ए-नौ मनाएँगे ,"
        "रंजिशें भुला कर हम नफ़रतें मिटाएँगे।"
        "🌟🔥🎆🎇🥳🧨🗽🎈",
    "दिल से निकली विश है हमारी, "
        "जिंदगी में मिले आपको ढेर सारी खुशियाँ,"
        " दुःख न दे खुदा आपको कभी, "
        "चाहे एक खुशी घटा दे हमारी,"
        " हैप्पी न्यू ईयर 2023."
        "🔥🎆🎇🥳🧨🗽"
  ];
  static List <String> diwali= [
    "घर मे धन की वर्षा हो,"
        "दीपो से चमकती शाम आए,"
        "सफलता मिले हर काम मे तुम्ह,े"
        "खुशियो का सदा पैगाम आए, !"
        "🌟🔥🎆🎇🧨💥🪔",
    "रोशनी के इस त्यौहार पर आपकी,"
        "हर एक ख्वाहिश मंजूर हो दुआ है,"
        "रब से आपके घर मे सुख समृद्धि और,"
        "खुशियो की बहार ! शुभ दीपावली !,"
        "🌟🔥🎆🎇🧨💥🪔",
    "हर दिन दिवाली हर दिन दशहरा है,"
        "हर दिन जिंदगी में एक नया सवेरा है..!"
        "🌟🔥🎆🎇🧨💥🪔",
    "एक दुआ मांगते है हम अपने,"
        "भगवान से चाहते है आपकी,"
        "ख़ुशी पुरे ईमान से सब हसरते,"
        "पूरी हो आपकी और आप,"
        "मुस्कुराए दिल-ओ-जान से !,"
        "🎆🎇🧨💥🪔",
    "फूल की शुरुआत कली से होती है,"
        "ज़िंदगी की शुरुआत प्यार से होती ह,ै"
        "प्यार की शुरुआत अपनो से होती है और,"
        "अपनो की शुरुआत आपसे होती है!,"
        "🎆🎇🧨💥🪔",
    "मन के अहंकार रूपी घमंड को,"
        "मिटाना है बुराई से खुद को बचाना है,"
        "और अच्छाई का साथ निभाना है,"
        "दिवाली की तरह पूरे जग को,"
        "रोशन बनाना है !,"
        "🎆🎇🧨💥🪔",
    "सोने और चांदी की बरसात निराली हो,"
        "घर का कोई कोना दौलत से खाली हो,"
        "सेहत भी रहे अच्छी चेहरे पे लाली हो,"
        "हँसते रहे आप ख़ुशहाली ही खुशहाली हो !"
        "Happy diwali 🌟🔥🎆🎇🧨💥🪔"

  ];
  static List <String> morning = [
    "रात की चांदनी से मांगता हु सवेरा,"
        "फूलों की चमक से मांगता हु रंग गहरा,"
        "दौलत शोहरत से ताल्लुख़ नहीं है मेरा,"
        "मुझे चाहिए हर सुबह में बस साथ तेरा..,"
        "Happy lovely morning,,"
        "🌞☀❄🌕🌝",
    "इस दिल का कहा मानो, एक काम कर दो,"
        "एक बेनाम सी मोहब्बत मेरे नाम कर दो,"
        "मुझ पर बस इतना ऐहसान कर दो,"
        "एक सुबह को मिलो और शाम कर दो,"
        "Good Morning ☕ Love You,"
        "🌞☀❄🌕🌝",
    "बाँहों में आ कर हमसे लिपट जाना,"
        "नज़रो से नज़रे मिला कर दिल में उतर जाना,"
        "फिर धीरे से अपने लबों को मेरे लबों से लड़ना,"
        "बस इतनी सी ख्वाहिश है हर सुबह की मेरे जाने जाना…।।"
        "Good Morning My Love,"
        "🌞☀❄🌕🌝",
    "सुबह-सुबह आपको एक पैगाम देना है,"
        "आपको सुबह का पहला सलाम देना है,"
        "गुजरे सारा दिन आपका खुशी में,"
        "आपकी सुबह को खूबसूरत सा नाम देना है।"
        "🌞☀❄🌕🌝"
  ];
  static List <String> night = [];
  static List <String> independence = [
    "नजारे नजर से ये कहने लगे,"
        "नयन से बड़ी चीज कोई नही,"
        "तभी मेरे दिल ने ये आवाज़ दी,"
        "वतन से बड़ी चीज कोई नही।"
        "स्वतंत्रता दिवस की शुभकामनाएं,"
        "🎆🎇🧨💥IND🏴🎈",
    "इतनी सी बात हवाओं को बताए रखना,"
        " रौशनी होगी चिरागों को जलाए रखना,"
        "लहू देकर की है जिसकी हिफाजत हमने,"
        "ऐसे kiwi flag को हमेशा अपने दिल में बसाए रखना।"
        " जय kiwis जय new zealand..!"
        "🎆🎇🧨💥ANZ🏴🎈",
    "सुन्दर है जग में सबसे, नाम भी न्यारा है,"
        "जहाँ जाती-भाषा से बढ़कर, देश-प्रेम की धारा है,"
        "निशचल, पवन, प्रेम पुराना, वो भारत देश हमारा है!!"
        "🎆🎇🧨💥IND🏴🎈",
    "जब आँख खुले तो धरती new zealand की हो,"
        "जब आँख बंद हो तो धरती new zealand की हो,"
        "हम मर भी जाए तो कोई गम नही लेकिन;"
        "मरते वक्त मिट्टी new zealand की हो।"
        "🎆🎇🧨💥ANZ🏴🎈"
  ];

}